## **Latihan Pandas 1**

## Jangan di-run! Buat file baru untuk menjawab

**Membuat DataFrame**

Ikuti semua petunjuk yang harus dilakukan di bawah ini.

**Step 1. Import library yang dibutuhkan.**

In [1]:
import numpy as np
import pandas as pd

**Step 2. Buat dictionary untuk membuat DataFrame berjumlah 5 key dan masing-masing key memiliki value berupa list dengan 10 item. Isi dari dictionary  mengikuti output Step 3.**

In [4]:
dict_student = {
    'Nama': ['Andi', 'Budi', 'Caca', 'Dedi', 'Erika', 'Fahri', 'Gina', 'Hani', 'Indro', 'Jarot'],
    'Umur': [24, 25, 30, 32, 28, 24, 29, 31, 30, 29],
    'Gender': ['Pria', 'Pria', 'Wanita', 'Pria', 'Wanita', 'Pria', 'Wanita', 'Wanita', 'Pria', 'Pria'],
    'Pekerjaan': ['Data Analyst', 'Data Engineer', 'Data Scientist', 'Data Scientist', 'Data Analyst', 'Data Engineer',
    'ML Engineer', 'ML Researcher', 'BI Analyst', 'Data Analyst'],
    'Domisili': ['Jakarta', 'Tangerang Selatan', 'Jakarta', 'Bandung', 'Jakarta', 'Surabaya',
    'Bandung', 'Yogyakarta', 'Jakarta', 'Tangerang Selatan']
}
dict_student

{'Nama': ['Andi',
  'Budi',
  'Caca',
  'Dedi',
  'Erika',
  'Fahri',
  'Gina',
  'Hani',
  'Indro',
  'Jarot'],
 'Umur': [24, 25, 30, 32, 28, 24, 29, 31, 30, 29],
 'Gender': ['Pria',
  'Pria',
  'Wanita',
  'Pria',
  'Wanita',
  'Pria',
  'Wanita',
  'Wanita',
  'Pria',
  'Pria'],
 'Pekerjaan': ['Data Analyst',
  'Data Engineer',
  'Data Scientist',
  'Data Scientist',
  'Data Analyst',
  'Data Engineer',
  'ML Engineer',
  'ML Researcher',
  'BI Analyst',
  'Data Analyst'],
 'Domisili': ['Jakarta',
  'Tangerang Selatan',
  'Jakarta',
  'Bandung',
  'Jakarta',
  'Surabaya',
  'Bandung',
  'Yogyakarta',
  'Jakarta',
  'Tangerang Selatan']}

**Step 3. Ubah dictionary dari Step.2 menjadi bentuk DataFrame dan simpan ke dalam variabel baru bernama df.**

In [9]:
df = pd.DataFrame(dict_student)
df

    Nama  Umur  Gender       Pekerjaan           Domisili
0   Andi    24    Pria    Data Analyst            Jakarta
1   Budi    25    Pria   Data Engineer  Tangerang Selatan
2   Caca    30  Wanita  Data Scientist            Jakarta
3   Dedi    32    Pria  Data Scientist            Bandung
4  Erika    28  Wanita    Data Analyst            Jakarta
5  Fahri    24    Pria   Data Engineer           Surabaya
6   Gina    29  Wanita     ML Engineer            Bandung
7   Hani    31  Wanita   ML Researcher         Yogyakarta
8  Indro    30    Pria      BI Analyst            Jakarta
9  Jarot    29    Pria    Data Analyst  Tangerang Selatan

**Step 4. Ubah urutan kolom tersebut menjadi seperti berikut: Nama, Gender, Umur, Domisili, Pekerjaan.**

In [12]:
df_urut = df[['Nama', 'Gender', 'Umur', 'Domisili', 'Pekerjaan']]
df_urut

    Nama  Gender  Umur           Domisili       Pekerjaan
0   Andi    Pria    24            Jakarta    Data Analyst
1   Budi    Pria    25  Tangerang Selatan   Data Engineer
2   Caca  Wanita    30            Jakarta  Data Scientist
3   Dedi    Pria    32            Bandung  Data Scientist
4  Erika  Wanita    28            Jakarta    Data Analyst
5  Fahri    Pria    24           Surabaya   Data Engineer
6   Gina  Wanita    29            Bandung     ML Engineer
7   Hani  Wanita    31         Yogyakarta   ML Researcher
8  Indro    Pria    30            Jakarta      BI Analyst
9  Jarot    Pria    29  Tangerang Selatan    Data Analyst

**Step 5. Tambahkan 1 kolom baru bernama 'Hobi' dan isikan datanya seperti output berikut.**

In [16]:
list_hoby = ['Gaming', 'Futsal', 'Baca', 'Gaming', 'Masak', 'Traveling', 'Basket', 'Traveling', 'Gaming', 'Futsal']
df['Hobi'] = list_hoby
df

    Nama  Umur  Gender       Pekerjaan           Domisili       Hobi
0   Andi    24    Pria    Data Analyst            Jakarta     Gaming
1   Budi    25    Pria   Data Engineer  Tangerang Selatan     Futsal
2   Caca    30  Wanita  Data Scientist            Jakarta       Baca
3   Dedi    32    Pria  Data Scientist            Bandung     Gaming
4  Erika    28  Wanita    Data Analyst            Jakarta      Masak
5  Fahri    24    Pria   Data Engineer           Surabaya  Traveling
6   Gina    29  Wanita     ML Engineer            Bandung     Basket
7   Hani    31  Wanita   ML Researcher         Yogyakarta  Traveling
8  Indro    30    Pria      BI Analyst            Jakarta     Gaming
9  Jarot    29    Pria    Data Analyst  Tangerang Selatan     Futsal

**Soal Lanjutan**

**6. Gunakan .iloc untuk mengambil data Dedi, Fahri, Hani**

In [18]:
df.iloc[3:8:2]

    Nama  Umur  Gender       Pekerjaan    Domisili       Hobi
3   Dedi    32    Pria  Data Scientist     Bandung     Gaming
5  Fahri    24    Pria   Data Engineer    Surabaya  Traveling
7   Hani    31  Wanita   ML Researcher  Yogyakarta  Traveling

**7. Gunakan .loc untuk menampilkan domisili dan pekerjaan dari Caca dan Irja (termasuk kolom nama)**

In [48]:
# df.iloc[2:8:6,3:5]
df[['Nama','Domisili','Pekerjaan']].loc[[2,8]]

    Nama Domisili       Pekerjaan
2   Caca  Jakarta  Data Scientist
8  Indro  Jakarta      BI Analyst

**8. Gunakan .loc untuk menampilkan semua data dari Hani, Irja, Jarot**

In [35]:
df.iloc[7:,:]

    Nama  Umur  Gender      Pekerjaan           Domisili       Hobi
7   Hani    31  Wanita  ML Researcher         Yogyakarta  Traveling
8  Indro    30    Pria     BI Analyst            Jakarta     Gaming
9  Jarot    29    Pria   Data Analyst  Tangerang Selatan     Futsal

**9. Siapa sajakah yang berumur lebih dari 30 tahun?**

In [40]:
df[df['Umur']>30]

   Nama  Umur  Gender       Pekerjaan    Domisili       Hobi
3  Dedi    32    Pria  Data Scientist     Bandung     Gaming
7  Hani    31  Wanita   ML Researcher  Yogyakarta  Traveling

**10. Siapa sajakah yang berumur kurang dari 30 tahun dan hobinya Gaming?**

In [41]:
df[(df['Umur']<30) & (df['Hobi']=='Gaming')]

   Nama  Umur Gender     Pekerjaan Domisili    Hobi
0  Andi    24   Pria  Data Analyst  Jakarta  Gaming

**11. Tampilkan nama orang yang pekerjaannya adalah Data Analyst! Tampilkan kolom nama saja dalam bentuk Series!**

In [50]:
df[df['Pekerjaan']=='Data Analyst'][['Nama']] #kurung sikunya 2 ya gaes

    Nama
0   Andi
4  Erika
9  Jarot

**12. Apa saja pekerjaan orang-orang yang berdomisili di Jakarta? Tampilkan nama dan pekerjaannya!**

In [51]:
df[df['Domisili']=='Jakarta'][['Nama','Pekerjaan']]

    Nama       Pekerjaan
0   Andi    Data Analyst
2   Caca  Data Scientist
4  Erika    Data Analyst
8  Indro      BI Analyst

**13. Apa saja hobi para wanita yang ada di data? Tampilkan hanya kolom Nama, Hobi, Umur secara berurutan!**

In [53]:
df[df['Gender']=='Wanita'][['Nama','Hobi','Umur']]

    Nama       Hobi  Umur
2   Caca       Baca    30
4  Erika      Masak    28
6   Gina     Basket    29
7   Hani  Traveling    31

**14. Siapa saja yang berumur lebih tua dari Erika? Tampilkan kolom nama saja dalam bentuk DataFrame!**

In [68]:
umur = df[df['Nama']=='Erika']['Umur'].values[0]
umur

28

In [69]:
df[df['Umur'] > df[df['Nama']=='Erika']['Umur'].values[0]][['Nama']]

    Nama
2   Caca
3   Dedi
6   Gina
7   Hani
8  Indro
9  Jarot

**15. Berdasarkan data, apakah ada wanita yang hobinya traveling?**

In [73]:
df[(df['Hobi']=='Traveling') & (df['Gender']=='Wanita')]

   Nama  Umur  Gender      Pekerjaan    Domisili       Hobi
7  Hani    31  Wanita  ML Researcher  Yogyakarta  Traveling

In [ ]:
df.pivot_table(
    index='Kota',
    columns='Salesman',
    values='Profit',
    aggfunc= 'sum' # defaultnya aggfunc='mean'
)